Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/justice/legal_aid_and_advice/legal_aid_certs.html.txt.tmx
Source language: en
Languages: ga

source: To obtain any of the legal aid certificates listed below, you must apply and show that you have insufficient means to pay for legal representation or, in the case of a child, the child or the child's parents or guardian have insufficient means
ga: Le haon cheann de na teastais chúnaimh dhlíthiúil ar an liosta thíos a fháil, ní mór duit iarratas a chur isteach agus a thaispeáint nach leor do mhaoin le híoc as ionadaíocht dlí, nó, i gcás linbh, nach leor maoin an linbh nó maoin thuismitheoirí nó chaomhnóra an linbh

source: There are penalties, including imprisonment, for providing false or misleading information inorder to obtain a certificate
ga: Tá pionós, lena n-áirítear príosúnacht, as faisnéis bhréagach nó mhíthreorach a chur ar fáil d’fhonn teastas a fháil

source: The court must also be satisfied that the offence, with which you are charged, is of such a serious nature, or there are exceptional circumstances, that it is essential in the interest of justice that legal aid be provided
ga: Caithfidh an chúirt a bheith sásta, chomh maith, go bhfuil an cion as ar ciontaíodh thú de nádúr tromchúiseach, nó go bhfuil tosca eisceachtúla ann, agus go bhfuil sé riachtanach chun leasa an cheartais go gcuirfí cúnamh dlíthiúil ar fáil

source: There are a number of legal aid certificates:
ga: Tá roinnt teastas cúnaimh dhlíthiúil ann:

source: • Legal aid (District Court) certificate
ga: • Teastas Cúnaimh Dhlíthiúil (Cúirt Dúiche)

source: • Legal aid (trial on indictment) certificate
ga: • Teastas Cúnaimh Dhlíthiúil (Triail Ar Díotáil)

source: • Legal aid (appeal) certificate
ga: • Teastas Cúnaimh Dhlíthiúil (Achomharc)

source: • Legal aid (case stated) certificate
ga: • Teastas Cúnaimh Dhlíthiúil (Cás Sonraithe)

source: • Legal aid (Supreme Court) certificate
ga: • Teastas Cúnaimh Dhlíthiúil (Cúirt Uachtarach)

source: • Special Criminal Court certificate
ga: • Teastas Cúirte Coiriúil Speisialta

source: • Legal aid (behaviour order) certificate
ga: • Teastas Cúnaimh Dhlíthiúil (Ordú Iompraíochta)

source: • Legal aid (civil order) certificate
ga: • Teastas Cúnaimh Dhlíthiúil (Ordú Sibhialta)

source: • Legal aid (monitoring order) certificate
ga: • Teastais um chúnamh dlíthiúil (ordú monatóireachta)

source: • Legal aid (protection of persons order) certificate
ga: • Teastais um chúnamh dlíthiúil (ordú um chosaint daoine)

source: • Legal aid (re-trial order) certificate
ga: • Teastais um chúnamh dlíthiúil (ordú atrialach)

source: Legal aid (District Court) certificate
ga: Teastas Cúnaimh Dhlíthiúil (Cúirt Dúiche)

source: When you are first charged and brought before the District Court you can apply for a legal aid (District Court) certificate
ga: Nuair a chiontaítear thú den chéad uair agus nuair a thugtar os comhair Cúirt Dhúiche thú, is féidir leat iarratas a dhéanamh le haghaidh Teastas Cúnaimh Dhlíthiúil (Cúirt Dhúiche)

source: This certificate entitles the solicitor assigned to the case to be paid for all his or her appearances in the District Court
ga: Leis an teastas seo bíonn an aturnae atá sannaithe don chás i dteideal íocaíocht a fháil as gach láithreas a dhéanann sé/sí sa Chúirt Dhúiche

source: If the charge is murder or if the case is of sufficient complexity and gravity, the legal aid (District Court) certificate will entitle you to both a solicitor and barrister at the District Court stage
ga: Más dúnmharú an cúiseamh, nó má tá castacht dhóthanach ag baint leis an gcás, beidh tú i dteideal aturnae agus abhcóide araon leis an dTeastas Cúnaimh Dhlíthiúil ag céim na Cúirte Dúiche

source: Legal aid (trial on indictment) certificate
ga: Teastas Cúnaimh Dhlíthiúil (Triail Ar Díotáil)

source: If you are sent forward from the District Court for trial at the Circuit Court or the Central Criminal Court you can apply for a legal aid (trial on indictment) certificate
ga: Má chuirtear ar aghaidh thú ón Chúirt Dúiche le haghaidh trialach ag an Cúirt Chuarda nó an Príomhchúirt Choiriúil is féidir leat iarratas a dhéanamh ar Theastas Cúnaimh Dlíthiúil (Triail Ar Díotáil)

source: This application can be made to the District Court when the District Court is sending you forward for trial or, it can be made to the court before which you are to be dealt with
ga: Is féidir an t-iarratas seo a dhéanamh chuig an gCúirt Dúiche nuair atá an Chúirt Dúiche do do chur ar aghaidh chun trialach nó, is féidir é a dhéanamh leis an gcúirt a dhéileálfaidh le do chás

source: You must be charged with murder or it must appear to the court that, in the interest of justice, you should have legal aid to assist you in the preparation and defence of your case
ga: Caithfidh tú a bheith ciontaithe as dúnmharú nó caithfidh gur léir don chúirt gur chóir duit cúnamh dlíthiúil a bheith agat le cuidiú leat do chás a ullmhú agus a chosaint, chun leasa an cheartais

source: This certificate will entitle you to both a solicitor and barrister
ga: Leis an teastas seo beidh tú i dteideal aturnae agus abhcóide araon

source: If you have been convicted of a criminal offence and wish to appeal that conviction or the penalty imposed, you can apply for a legal aid (appeal) certificate
ga: Má chiontaítear tú as cion coiriúil agus más mian leat an ciontú sin nó an pionós a gearradh a achomharc, is féidir leat iarratas a dhéanamh ar Theastas Cúnaimh Dhlíthiúil (Achomharc)

source: The application is usually made to the court before which you have been convicted
ga: De ghnáth, déantar an t-iarratas leis an gcúirt inar ciontaíodh tú

source: If the application is refused in that court you can still get the certificate by applying to the court in which your appeal is to be heard
ga: Má dhiúltaítear an t-iarratas sa chúirt sin is féidir leat an teastas a fháil fós trí iarratas a dhéanamh sa chúirt ina n-éistfear le d’achomharc

source: There are two ways of applying to the appeal court:
ga: Tá dhá dhóigh le hiarratas a dhéanamh leis an gcúirt achomhairc:

source: • By sending a letter to the registrar of the court stating the facts of the case and the grounds for your appeal
ga: • Trí litir a chur chuig cláraitheoir na cúirte ag leagan amach fíorais an cháis agus forais d’achomhairc

source: • By applying directly to the court itself
ga: • Trí iarratas a dhéanamh go díreach leis an gcúirt féin

source: To be eligible for the certificate the conviction must be for murder, or the court must be satisfied that due to the serious nature of the offence it is necessary, in the interests of justice, that you should have legal aid
ga: Le bheith incháilithe le haghaidh an teastais caithfidh an cúiseamh a bheith as dúnmharú, nó caithfidh an chúirt a bheith sásta go bhfuil sé riachtanach, mar gheall ar nádúr tromchúiseach an chiona, go mbeadh cúnamh dlíthiúil agat, chun leasa an cheartais

source: The certificate entitles you to a solicitor
ga: Leis an teastas seo tá tú i dteideal aturnae a bheith agat

source: If the appeal is to the Court of Appeal, however, you are also entitled to a barrister
ga: Má tá an t-achomharc chuig an Chúirt Achomhairc áfach, beidh tú i dteideal abhcóide a bheith agat chomh maith

source: Legal aid (case stated) certificate
ga: Teastas Cúnaimh Dhlíthiúil (Cás Sonraithe)

source: If you are charged with an offence before the District Court or Circuit Court, or you are appealing to the Circuit Court against a conviction by the District Court, the judge who is hearing the case may refer a question of law which arises from the hearing to the High Court, the Court of Appeal or the Supreme Court
ga: Má chiontaítear thú as cion os comhair na Cúirte Dúiche nó na Cúirte Cuarda, nó má tá tú ag déanamh achomhairc chuig an gCúirt Chuarda in aghaidh do chiontaithe ag an gCúirt Dúiche, is féidir leis an mbreitheamh atá ag éisteacht leis an gcás ceist dlí a thagann as an éisteacht a chur ar aghaidh chuig an Ard-Chúirt, an Chúirt Achomhairc nó an Chúirt Uachtarach

source: This is known as a case stated
ga: Tugtar cás sonraithe air seo

source: Similarly, the District Court judge hearing the case may state a case for the opinion of the High Court
ga: Ar an dóigh chéanna, b’fhéidir go leagfadh breitheamh na Cúirte Dúiche atá ag éisteacht leis an gcás, amach cás le haghaidh bharúil na hArd-Chúirte

source: In these situations you can apply for a legal aid (case stated) certificate
ga: Sna cásanna seo is féidir leat iarratas a chur isteach ar Theastas Cúnaimh Dhlíthiúil (Cás Sonraithe)

source: If the application to the District Court or Circuit Court is refused, you can apply for a certificate to the court before which the case stated is to be heard
ga: Má dhiúltaítear an t-iarratas chuig an gCúirt Dúiche nó chuig an gCúirt Chuarda, is féidir leat iarratas a chur isteach ar theastas chuig an gcúirt a mbeidh an cás sonraithe le héisteacht ann

source: This can be done by:
ga: Is féidir é seo a dhéanamh trí:

source: • Sending a letter to the registrar of the court setting out the facts of the case and the reason for the application or
ga: • Litir a chur chuig cláraitheoir na cúirte ag leagan amach fíorais an cháis agus fáth an iarratais nó

source: • Applying directly to the court
ga: • Iarratas a dhéanamh go díreach leis an gcúirt

source: To be eligible the offence must be of a serious nature or exceptional circumstances must apply. This certificate entitles you to both a solicitor and barrister
ga: Le bheith i dteideal caithfidh an cion a bheith de nádúr tromchúiseach nó caithfidh imthosca eisceachtúla a bheith i bhfeidhm

source: Legal aid (Supreme Court) certificate
ga: Teastas Cúnaimh Dhlíthiúil (Cúirt Uachtarach)

source: If you are appealing a finding of the Court of Appeal to the Supreme Court you can apply for a legal aid (Supreme Court) certificate
ga: Má bhíonn tú ag déanamh achomhairc in éadan chinneadh na Cúirte Achomhairc leis an gCúirt Uachtarach is féidir leat iarratas a dhéanamh ar Theastas Cúnaimh Dhlíthiúil (Cúirt Uachtarach)

source: Similarly, if you are charged with an offence, you can apply for a certificate where you appeal a finding of the High Court on a case stated by a District Court judge to the Supreme Court
ga: Ar an dóigh chéanna, má chiontaítear as cion tú, is féidir leat iarratas a dhéanamh ar theastas nuair a dhéanann tú achomharc faoi chinneadh na hArd-Chúirte sonraithe ag breitheamh de chuid na Cúirte Dúiche chuig an gCúirt Uachtarach

source: Where you are appealing a finding of the High Court the offence must be of a serious nature or exceptional circumstances must apply
ga: Nuair a bhíonn tú ag déanamh achomhairc in éadan chinneadh na hArd-Chúirte caithfidh an cion a bheith de nádúr tromchúiseach nó caithfidh tosca eisceachtúla a bheith i bhfeidhm

source: If the application for a legal aid (Supreme Court) certificate is refused, you can apply to the Supreme Court for a certificate by writing to the registrar or applying directly to the court
ga: Má dhiúltaítear iarratas ar Theastas Cúnaimh Dhlíthiúil (Cúirt Uachtarach), is féidir leat iarratas a dhéanamh chuig an gCúirt Uachtarach le teastas a fháil trí scríobh chuig an gcláraitheoir nó trí iarratas a dhéanamh go díreach leis an gcúirt

source: This certificate entitles you to both a solicitor and barrister
ga: Leis an dteastas seo tá tú i dteideal aturnae agus abhcóide araon a bheith agat

source: Special Criminal Court certificate
ga: Teastas na Cúirte Coiriúla Speisialta

source: The Special Criminal Court can grant a legal aid certificate to a person charged with an offence before the Special Criminal Court
ga: Is féidir leis an Cúirt Choiriúil Speisialta Teastas Cúnaimh Dhlíthiúil a dheonú ar dhuine atá ciontaithe as cion os comhair na Cúirte Coiriúla Speisialta

source: The conditions that apply are exactly the same as those for a legal aid (trial on indictment) certificate
ga: Tá na coinníollacha atá i bhfeidhm go díreach mar an gcéanna leis na coinníollacha do Theastas Cúnaimh Dhlíthiúil (Triail Ar Dhíotáil)

source: This certificate entitles you to the services of both a solicitor and a barrister
ga: Leis an teastas seo tá tú i dteideal seirbhísí aturnae agus abhcóide araon

source: Legal aid (behaviour order) certificate
ga: Teastas Cúnaimh Dhlíthiúil (Ordú Iompraíochta)

source: If your child (under age 18) is the subject of any court proceedings relating to a behaviour order you may be able to apply for a legal aid (behaviour order) certificate
ga: Má tá do leanbh (faoi bhun 18) faoi réir ag aon imeachtaí cúirte maidir le ordú iompraíochta b’fhéidir go mbeifeá in ann iarratas a dhéanamh le haghaidh Teastas Cúnaimh Dhlíthiúil (Ordú Iompraíochta)

source: The alleged anti-social behaviour must be considered to be of a serious nature or there must be exceptional circumstances
ga: Caithfear a mheas go bhfuil an iompraíocht fhríthshóisialta atá líomhanta de nádúr tromchúiseach nó caithfidh imthosca eisceachtúla a bheith ann

source: If a certificate is granted, your child is entitled to a solicitor for:
ga: Má dheonaítear do theastas, tá do leanbh i dteideal aturnae a bheith aige le haghaidh:

source: • An application by the Gardaí for a behaviour order
ga: • Iarratas ó na gardaí le haghaidh ordaithe iompraíochta

source: • An application by you or your child to vary or discharge a behaviour order
ga: • Iarratas uaitse nó ó do leanbh le hordú iompraíochta a athrú nó a urscaoileadh

source: You child is entitled to a solicitor and a barrister (if considered appropriate) for:
ga: Tá do leanbh i dteideal aturnae agus abhcóide (má mheastar gur cuí sin) le haghaidh:

source: • An appeal by you or your child against the making of a behaviour order
ga: • Achomharc a dhéanann tusa nó do leanbh in aghaidh ordaithe iompraíochta

source: • Any proceedings in the High Court, Court of Appeal or Supreme Court which result from the application for or the appeal against a behaviour order
ga: • Aon imeachtaí san ArdChúirt, sa Chúirt Achomhairc nó sa Chúirt Uachtarach a bhíonn ann de thoradh iarratais ar nó achomharc in aghaidh ordaithe iompraíochta

source: Legal aid (civil order) certificate
ga: Teastas Cúnaimh Dhlíthiúil (Ordú Sibhialta)

source: If you are the subject of any court proceedings relating to a civil order you may be able to apply for a legal aid (civil order) certificate
ga: Má tá tú faoi réir aon imeachtaí cúirte a bhaineann le ordú sibhialta b’fhéidir go mbeifeá in ann iarratas a chur isteach le haghaidh Teastas Cúnaimh Dhlíthiúil (Ordú Sibhialta)

source: If a certificate is granted, you are entitled to a solicitor for:
ga: Má dheonaítear teastas, tá tú i dteideal aturnae a bheith agat le haghaidh:

source: • An application by the Gardaí for a civil order
ga: • Iarratas ó na gardaí le haghaidh ordaithe shibhialta

source: • An application by you to vary or discharge a civil order
ga: • Iarratas uaitse le hordú sibhialta a athrú nó a urscaoileadh

source: You are entitled to a solicitor and a barrister (if considered appropriate) for:
ga: Tá tú i dteideal aturnae nó abhcóide a bheith agat (má mheastar gur cuí sin) le haghaidh:

source: • An appeal by you against the making of a civil order
ga: • Achomharc a dhéanann tú i gcoinne ordaithe shibhialta

source: • Any proceedings in the High Court, Court of Appeal or Supreme Court which result from the application for or the appeal against a civil order
ga: • Aon imeachtaí san Ard-Chúirt, sa Chúirt Achomhairc nó sa Chúirt Uachtarach a tharlaíonn de thoradh an iarratais ar achomharc in aghaidh ordaithe shibhialta

source: Legal aid (monitoring order) certificate
ga: Teastais um chúnamh dlíthiúil (ordú monatóireachta)

source: If you are subject to a monitoring order and and intend applying to the courts to have it varied or revoked, you may be able to apply for a legal aid (monitoring order) certificate
ga: Má tá tú faoi réir ordú monatóireachta agus más mian leat iarratas a dhéanamh ar na cúirteanna go ndéanfaí é a éagsúlú nó a aisghairm, d’fhéadfá bheith in ann iarratas a dhéanamh ar theastas um chúnamh dlíthiúil (ordú monatóireachta)

source: The conditions specified in the monitoring order must be of such a nature or the circumstances so exceptional that the court feels legal aid should be granted in the interests of justice
ga: Ní mór go mbíonn nádúr ar leith nó cúinsí na gcoinníollacha a shonraítear san ordú monatóireachta chomh heisceachtúil go mbraitheann an chúirt gur cheart cúnamh dlíthiúil a cheadú ar mhaithe le ceartas

source: This certificate entitles you to the services of a solicitor and, if considered appropriate by the court, a barrister
ga: Beidh tú i dteideal, leis an teastas seo, seirbhísí aturnae agus, má mheasann an chúirt gur cuí, seirbhísí abhcóide a fháil

source: Legal aid (protection of persons order) certificate
ga: Teastais um chúnamh dlíthiúil (ordú um chosaint daoine)

source: If you are subject to a protection of persons order and and intend applying to the courts to have it varied or revoked, you may be able to apply for a legal aid (protection of persons order) certificate
ga: Má tá tú faoi réir ordú um chosaint daoine agus más mian leat iarratas a dhéanamh ar na cúirteanna go ndéanfaí é a éagsúlú nó a aisghairm, d’fhéadfá bheith in ann iarratas a dhéanamh ar theastas um chúnamh dlíthiúil (ordú um chosaint daoine)

source: The conditions specified in the protection of persons order must be of such a nature or the circumstances so exceptional that the court feels legal aid should be granted in the interests of justice
ga: Ní mór go mbíonn nádúr ar leith nó cúinsí na gcoinníollacha a shonraítear san ordú um chosaint daoine chomh heisceachtúil go mbraitheann an chúirt gur cheart cúnamh dlíthiúil a cheadú ar mhaithe le ceartas

source: Legal aid (re-trial order) certificate
ga: Teastais um chúnamh dlíthiúil (ordú atrialach)

source: If you are the subject of any proceedings in the Court of Appeal relating to a re-trial order, you may be able to apply for a legal aid (re-trial order) certificate
ga: Má tá tú faoi réir aon imeachtaí sa Chúirt Achomhairc lena mbaineann ordú atrialach, d’fhéadfá bheith in ann iarratas a dhéanamh ar theastas um chúnamh dlíthiúil (ordú atrialach)

source: It must appear to the court that, in the interests of justice, you should have legal aid to assist you in the preparation and conduct of your case.This certificate entitles you to both a solicitor and a barrister
ga: Ní mór gur dealraitheach don chúirt, ar mhaithe le ceartas, gur cheart go mbeadh cúnamh dlíthiúil agat chun lámh chúnta a thabhairt duit i réiteach agus i dtabhairt faoi do cháis. Beidh tú i dteideal, leis an teastas seo, chun aturnae agus abhcóide a fháil
